n2nresult/pubsub-11k-1594579199.txt
wrk -t 20 -c 100 -d30s -R 30000 -file_k 11 --latency http://192.168.1.4:8089
Running 30s test @ http://192.168.1.4:8089
  20 threads and 100 connections
  Thread calibration: mean lat.: 1.030ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.062ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.039ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.025ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.029ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.045ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.012ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.036ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.035ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.027ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.017ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.022ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.057ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.027ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.044ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.032ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.051ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.055ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.058ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.028ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.04ms  445.42us   6.82ms   64.76%
    Req/Sec     1.59k   104.19     2.11k    77.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%       1.03 ms
 75.000%       1.36 ms
 90.000%       1.62 ms
 99.000%       2.04 ms
 99.900%       2.31 ms
 99.990%       4.55 ms
 99.999%       5.99 ms
100.000%       6.83 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.120     0.000000            1         1.00
       0.437     0.100000        54205         1.11
       0.615     0.200000       108027         1.25
       0.772     0.300000       162068         1.43
       0.904     0.400000       216058         1.67
       1.031     0.500000       270304         2.00
       1.093     0.550000       297058         2.22
       1.157     0.600000       324422         2.50
       1.221     0.650000       351330         2.86
       1.286     0.700000       378140         3.33
       1.356     0.750000       405318         4.00
       1.392     0.775000       418685         4.44
       1.430     0.800000       432178         5.00
       1.470     0.825000       445815         5.71
       1.512     0.850000       459251         6.67
       1.559     0.875000       472766         8.00
       1.586     0.887500       479379         8.89
       1.617     0.900000       486191        10.00
       1.652     0.912500       492836        11.43
       1.694     0.925000       499573        13.33
       1.743     0.937500       506299        16.00
       1.769     0.943750       509644        17.78
       1.797     0.950000       513081        20.00
       1.825     0.956250       516400        22.86
       1.855     0.962500       519780        26.67
       1.888     0.968750       523195        32.00
       1.905     0.971875       524911        35.56
       1.922     0.975000       526527        40.00
       1.941     0.978125       528256        45.71
       1.961     0.981250       529896        53.33
       1.986     0.984375       531634        64.00
       1.999     0.985938       532467        71.11
       2.013     0.987500       533312        80.00
       2.029     0.989062       534139        91.43
       2.047     0.990625       534961       106.67
       2.069     0.992188       535842       128.00
       2.081     0.992969       536268       142.22
       2.093     0.993750       536649       160.00
       2.109     0.994531       537098       182.86
       2.125     0.995313       537494       213.33
       2.143     0.996094       537910       256.00
       2.153     0.996484       538119       284.44
       2.167     0.996875       538338       320.00
       2.183     0.997266       538551       365.71
       2.199     0.997656       538757       426.67
       2.219     0.998047       538967       512.00
       2.231     0.998242       539072       568.89
       2.249     0.998437       539178       640.00
       2.265     0.998633       539285       731.43
       2.287     0.998828       539395       853.33
       2.311     0.999023       539495      1024.00
       2.327     0.999121       539548      1137.78
       2.347     0.999219       539598      1280.00
       2.379     0.999316       539651      1462.86
       2.409     0.999414       539701      1706.67
       2.567     0.999512       539754      2048.00
       2.639     0.999561       539780      2275.56
       2.807     0.999609       539807      2560.00
       2.971     0.999658       539833      2925.71
       3.137     0.999707       539859      3413.33
       3.349     0.999756       539887      4096.00
       3.449     0.999780       539900      4551.11
       3.719     0.999805       539912      5120.00
       3.883     0.999829       539925      5851.43
       4.081     0.999854       539938      6826.67
       4.375     0.999878       539952      8192.00
       4.427     0.999890       539958      9102.22
       4.579     0.999902       539966     10240.00
       4.651     0.999915       539971     11702.86
       4.835     0.999927       539978     13653.33
       4.959     0.999939       539985     16384.00
       5.031     0.999945       539988     18204.44
       5.123     0.999951       539991     20480.00
       5.267     0.999957       539994     23405.71
       5.519     0.999963       539998     27306.67
       5.611     0.999969       540001     32768.00
       5.679     0.999973       540003     36408.89
       5.687     0.999976       540004     40960.00
       5.739     0.999979       540006     46811.43
       5.807     0.999982       540008     54613.33
       5.835     0.999985       540009     65536.00
       5.951     0.999986       540010     72817.78
       5.983     0.999988       540011     81920.00
       5.987     0.999989       540012     93622.86
       6.059     0.999991       540013    109226.67
       6.059     0.999992       540013    131072.00
       6.259     0.999993       540014    145635.56
       6.259     0.999994       540014    163840.00
       6.471     0.999995       540015    187245.71
       6.471     0.999995       540015    218453.33
       6.471     0.999996       540015    262144.00
       6.491     0.999997       540016    291271.11
       6.491     0.999997       540016    327680.00
       6.491     0.999997       540016    374491.43
       6.491     0.999998       540016    436906.67
       6.491     0.999998       540016    524288.00
       6.827     0.999998       540017    582542.22
       6.827     1.000000       540017          inf
#[Mean    =        1.038, StdDeviation   =        0.445]
#[Max     =        6.824, Total count    =       540017]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  840482 requests in 28.03s, 681.27MB read
Requests/sec:  29987.78
Transfer/sec:     24.31MB
wrk -t 20 -c 100 -d30s -R 30000 -file_k 11 --latency http://192.168.1.4:8089
Running 30s test @ http://192.168.1.4:8089
  20 threads and 100 connections
  Thread calibration: mean lat.: 1.059ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.042ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.030ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.054ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.022ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.045ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.028ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.023ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.023ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.030ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.064ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.012ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.055ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.052ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.021ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.020ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.039ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.032ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.040ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.042ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.04ms  443.03us   6.28ms   64.77%
    Req/Sec     1.59k   101.41     2.11k    79.56%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%       1.03 ms
 75.000%       1.35 ms
 90.000%       1.61 ms
 99.000%       2.04 ms
 99.900%       2.35 ms
 99.990%       4.09 ms
 99.999%       5.91 ms
100.000%       6.28 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.125     0.000000            1         1.00
       0.441     0.100000        59945         1.11
       0.620     0.200000       120165         1.25
       0.772     0.300000       180126         1.43
       0.904     0.400000       239713         1.67
       1.033     0.500000       299892         2.00
       1.098     0.550000       329985         2.22
       1.162     0.600000       359775         2.50
       1.224     0.650000       389480         2.86
       1.287     0.700000       419465         3.33
       1.355     0.750000       449718         4.00
       1.392     0.775000       464743         4.44
       1.430     0.800000       479531         5.00
       1.469     0.825000       494345         5.71
       1.510     0.850000       509320         6.67
       1.556     0.875000       524469         8.00
       1.582     0.887500       531800         8.89
       1.611     0.900000       539312        10.00
       1.645     0.912500       546776        11.43
       1.685     0.925000       554276        13.33
       1.732     0.937500       561779        16.00
       1.758     0.943750       565543        17.78
       1.787     0.950000       569329        20.00
       1.817     0.956250       573010        22.86
       1.849     0.962500       576806        26.67
       1.882     0.968750       580492        32.00
       1.900     0.971875       582358        35.56
       1.919     0.975000       584246        40.00
       1.940     0.978125       586148        45.71
       1.961     0.981250       587940        53.33
       1.986     0.984375       589858        64.00
       1.999     0.985938       590756        71.11
       2.015     0.987500       591693        80.00
       2.033     0.989062       592651        91.43
       2.053     0.990625       593581       106.67
       2.077     0.992188       594544       128.00
       2.089     0.992969       594981       142.22
       2.103     0.993750       595427       160.00
       2.119     0.994531       595934       182.86
       2.137     0.995313       596384       213.33
       2.157     0.996094       596831       256.00
       2.169     0.996484       597078       284.44
       2.185     0.996875       597325       320.00
       2.199     0.997266       597542       365.71
       2.217     0.997656       597786       426.67
       2.239     0.998047       598013       512.00
       2.253     0.998242       598121       568.89
       2.271     0.998437       598238       640.00
       2.291     0.998633       598358       731.43
       2.319     0.998828       598473       853.33
       2.353     0.999023       598591      1024.00
       2.377     0.999121       598648      1137.78
       2.409     0.999219       598705      1280.00
       2.457     0.999316       598761      1462.86
       2.547     0.999414       598819      1706.67
       2.679     0.999512       598878      2048.00
       2.759     0.999561       598907      2275.56
       2.835     0.999609       598936      2560.00
       3.007     0.999658       598966      2925.71
       3.155     0.999707       598996      3413.33
       3.309     0.999756       599024      4096.00
       3.373     0.999780       599039      4551.11
       3.487     0.999805       599053      5120.00
       3.603     0.999829       599068      5851.43
       3.765     0.999854       599083      6826.67
       3.979     0.999878       599097      8192.00
       4.057     0.999890       599105      9102.22
       4.115     0.999902       599112     10240.00
       4.231     0.999915       599119     11702.86
       4.479     0.999927       599127     13653.33
       4.647     0.999939       599134     16384.00
       4.739     0.999945       599138     18204.44
       4.863     0.999951       599141     20480.00
       5.039     0.999957       599145     23405.71
       5.135     0.999963       599149     27306.67
       5.251     0.999969       599152     32768.00
       5.363     0.999973       599154     36408.89
       5.383     0.999976       599156     40960.00
       5.543     0.999979       599158     46811.43
       5.579     0.999982       599160     54613.33
       5.611     0.999985       599161     65536.00
       5.659     0.999986       599162     72817.78
       5.723     0.999988       599163     81920.00
       5.911     0.999989       599165     93622.86
       5.911     0.999991       599165    109226.67
       6.127     0.999992       599166    131072.00
       6.127     0.999993       599166    145635.56
       6.235     0.999994       599167    163840.00
       6.235     0.999995       599167    187245.71
       6.271     0.999995       599168    218453.33
       6.271     0.999996       599168    262144.00
       6.271     0.999997       599168    291271.11
       6.275     0.999997       599169    327680.00
       6.275     0.999997       599169    374491.43
       6.275     0.999998       599169    436906.67
       6.275     0.999998       599169    524288.00
       6.275     0.999998       599169    582542.22
       6.283     0.999998       599170    655360.00
       6.283     1.000000       599170          inf
#[Mean    =        1.039, StdDeviation   =        0.443]
#[Max     =        6.280, Total count    =       599170]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  899652 requests in 30.00s, 729.24MB read
Requests/sec:  29991.75
Transfer/sec:     24.31MB